In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
s = pd.Series(["Ghadah", "Alanoud", "Haifa"], index=[1,2,3])
s

1     Ghadah
2    Alanoud
3      Haifa
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
s.index = [11,12,13]
s

11     Ghadah
12    Alanoud
13      Haifa
dtype: object

## Q3: Retrieve First and second elements.

In [7]:
s[11], s[13]

('Ghadah', 'Haifa')

## Q4: Add duplicate elements, then remove the duplication

In [12]:
s = s.append(pd.Series(["Ghadah"], index=[14]))
s

11     Ghadah
12    Alanoud
13      Haifa
14     Ghadah
dtype: object

In [13]:
s.drop_duplicates(inplace=True)
s

11     Ghadah
12    Alanoud
13      Haifa
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [15]:
Students = pd.DataFrame(data = {'ID': [1, 2, 3], 'Name': ["Ghadah", "Alanoud", "Haifa"]})
Students

   ID     Name
0   1   Ghadah
1   2  Alanoud
2   3    Haifa

## Q6: Read educ_figdp_1_Data.csv file

In [17]:
df = pd.read_csv('educ_figdp_1_Data.csv', na_values=':')
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,NaN,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,NaN,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [20]:
# Slicing use indexes as integer
df[1:7]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,NaN,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e

In [25]:
# or
df.iloc[1:7]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,NaN,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e

In [24]:
# loc use both indexes as integer and labels (columns name)
df.loc[1:7, ['GEO', 'TIME']]

                             GEO  TIME
1  European Union (28 countries)  2001
2  European Union (28 countries)  2002
3  European Union (28 countries)  2003
4  European Union (28 countries)  2004
5  European Union (28 countries)  2005
6  European Union (28 countries)  2006
7  European Union (28 countries)  2007